tutorials/multiphaseTransport/interTransferFoam/risingBubble2D/constant/thermoPhysicalProperties0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solutionSpecies
{
   Species 
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] Diff_1;
		D2 D2 [ 0 2 -1 0 0 0 0 ] Diff_2;
		H H [ 0 0 0 0 0 0 0 ] H_12; 
                Mw Mw [1 0 0 0 -1 0 0] M_w; 
	}
};

// ************************************************************************* //
